# k = (1, 2, 3, 4, 5)
# print(k.index(1))
"""
# конкатенация кортежей
k1 = (1, 2, 3)
k2 = (4, 5, 6)
k3 = k1 + k2
print(k3)

s1 = [2, 4, 8, 16, 32]
s1.insert(1, 10)
print(s1)

s1 = [1, 2, 3]
s2 = [4, 5, 6]
s1.extend(s2)
print(s1)

# умножение списков
s1 = [1, 2, 3]
print(s1 * 2)

# удаление
s1 = [1, 2, 3, 4, 5]
s1.remove(1)
print(s1)

# срезы со списком
s3 = ['w', 38, 'z', 49, 'f']
print(s3[-2:])
"""
# s2 = [12, 33, 'w', 4, 'c']
# s2[-2:] = ['t2', 'q2']
# print(s2)
#
# s2 = [8, 1, 'w', 4, 2]
# s2[-2:-2] = ['t', 'q']
# print(s2)

"""
# превращение строки в кортеж из символов
k1 = "Вихри снежные крутя"
k2 = tuple(k1)
print(k2)

# превращение строки в список символов
s1 = "Вихри снежные крутя"
s2 = list(s1)
print(s2)
"""

"""
# подсчет количества
k = (1, 2, 3, 1, 4, 5, 1)
print(k.count(1))

# поиск элемента
k = (1, 2, 1, 3, 1, 4)
print(k.index(4))

k = (1, 2, 1, 3, 1, 4)
print(k.index(1, 3)) # 1е число - которое ищем. 2е - с какого индекса

k = (1, 2, 3, 4, 5)
a = 4
if a in k:
    i = k.index(a)
    print(f"Индекс {a} в кортеже: {i}")
else:
    print(f"Элемент {a} не найден в кортеже.")
    
"""

"""
# поиск максимального числа в списке
s1 = [2, 64, 80, 4, 32, 16]
print(max(s1))

# поиск максимального среди текстовых строк (ближайшего к концу алфавита)
s1 = ['Буря', 'мглою', 'небо', 'кроет']
print(max(s1))
"""
"""
#--------------------------------------------------
# извлекаем имя файла из URL
url = "https://example.com/path/to/file.txt"
f = url.split("/")[-1]
print(f"Имя файла из URL: {f}")

# пример из лекции
sp = [1, 'python', True, 2.1, [4, 2, 3]]
print(f"{sp} - {len(sp)}")
sp.append(5)
print(f"{sp} - {len(sp)}")
"""
#--------------------------------------------------

# HW
"""
Дан список s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
С использованием цикла и условного оператора подсчитайте количество единиц в этом списке.
"""
s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
count = 0
for i in s:
    if i == 1:
        count += 1
print(count)

"""
Дан список s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
Подсчитайте количество нулей в списке с помощью метода count.
"""
s=[1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1]
cnt = s.count(0)
print(cnt)

"""
Дан список s=[10, 25, 14, 11, 32, 21, 34, 42, 45, 67, 43, 32]
С использованием цикла вычислите среднее арифметическое значений списка.
"""
s=[10, 25, 14, 11, 32, 21, 34, 42, 45, 67, 43, 32]
quantity = len(s)
# print(quantity)
sum = 0
for i in s:
    sum = sum + i
# print(sum)
avg = sum / quantity
print(avg)
